leetcode_121_best_time_to_buy_and_sell_stock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 121. Best Time to Buy and Sell Stock</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 121. Best Time to Buy and Sell Stock</h1>

<div id="outline-container-org614fca2" class="outline-2">
<h2 id="org614fca2">Patterns</h2>
<div class="outline-text-2" id="text-org614fca2">
<ul class="org-ul">
<li><a href="pattern_search_for_max_min_value_in_unsorted_array.html#ID-D4CE3EFB-3F15-4FA2-80A2-9B8E1A1E0EA6">Pattern: Search for max/min value in unsorted array</a>.</li>

<li><a href="pattern_problem_s_constraints_disallow_o_n_2_solutions.html#ID-FCF0DB21-F99D-4A98-B592-6889DB9FE1F4">Pattern: Problem's constraints disallow \(O(n^2)\) solutions</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org5bafd4a" class="outline-2">
<h2 id="org5bafd4a">Prompts</h2>
<div class="outline-text-2" id="text-org5bafd4a">
<ul class="org-ul">
<li><a href="can_we_solve_the_problem_by_iterating_from_left_to_right_or_right_to_left.html#ID-C4FCF1BD-0D05-4D47-8FAB-B6002A8F4F09">Can we solve the problem by iterating from left to right (or right to left)?</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcd9273b" class="outline-2">
<h2 id="orgcd9273b">Solution</h2>
<div class="outline-text-2" id="text-orgcd9273b">
<p>
Suppose we know that the best day to buy is on \(i\)th day but we don't know when to sell the stock to maximize the profit.  In this case, the problem becomes finding the index \(j\) where \(j > i\) and \(prices[j]-prices[i]\) is the maximum possible profit.  The naive approach to find \(j\) consists on iterating over \(i+1,i+2,...,n-1\).  While it solves the problem, this solution is \(O(n^2)\) and does not pass on all tests.  Therefore, we have to come up with a more efficient way to find \(j\).
</p>

<p>
Without knowing any interesting property about \(prices\), we might have to use extra memory to efficiently find the index \(j\).  Be \(f(i)\) the maximum value in \(prices[i,i+1,..,n-1]\).  We can define \(f\) recursively as \(f(i)=max(prices[i], f(i+1))\).  More, we can compute \(f\) by iterating over the input from right to left.
</p>

<p>
The problem of finding \(j\) became trivial if we use \(f\).  We first compute \(f\) and them solve the original problem.  Going back to the original problem, for each \(i\) it is possible to test if buying on \(i\)th day and selling for the price of \(f(i+1)\) is the best option.  The algorithm has time and space complexity of \(O(n)\).  <i>Wait, we can do better than that!</i>  While we search for the best \(i\) from right to left, we can keep track of the last value of \(f(i+1)\) since this is the only interesting value when testing \(i\).  This optimization will reduce the space complexity to \(O(1)\) making the solution more efficient.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maxProfit</span>(<span style="font-weight: bold;">self</span>, prices: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold; font-style: italic;">ans</span>, <span style="font-weight: bold; font-style: italic;">m</span> = 0, <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"-inf"</span>)
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">reversed</span>(prices):
            <span style="font-weight: bold; font-style: italic;">ans</span> = <span style="font-weight: bold;">max</span>(ans, m - n)
            <span style="font-weight: bold; font-style: italic;">m</span> = <span style="font-weight: bold;">max</span>(m, n)
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>


<div id="outline-container-org39dd58a" class="outline-2">
<h2 id="org39dd58a">Cited by 1</h2>
<div class="outline-text-2" id="text-org39dd58a">
<ul class="org-ul">
<li><a href="interview_preparation_v.html#ID-8C7E9E52-9220-4A7B-B0E6-54F960E17CA8">Interview preparation: V</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>